In [177]:
import numpy as np
import pandas as pd
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

b= pd.DataFrame(exam_data)
print(b.head(3))

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes

In [178]:
b = b.dropna()
print(b)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [179]:
print(b.loc[:,'name':'score'])

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
8      Kevin    8.0
9      Jonas   19.0

In [180]:
k={'name' : ['Suresh'], 'score': [15.5], 'attempts': [1], 'qualify': ['yes']}
k=pd.DataFrame(k)
x=pd.concat([b,k])
print(x)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes
0     Suresh   15.5         1     yes

In [181]:
x= pd.DataFrame(x)
x=x.drop("attempts", axis=1)
print(x)

        name  score qualify
0  Anastasia   12.5     yes
1       Dima    9.0      no
2  Katherine   16.5     yes
4      Emily    9.0      no
5    Michael   20.0     yes
6    Matthew   14.5     yes
8      Kevin    8.0      no
9      Jonas   19.0     yes
0     Suresh   15.5     yes

In [184]:
success=[]
for i in x.score:
    if i<10:
        success.append(0)
    else :
        success.append(1)

x["success"]=success        
"""
success=pd.DataFrame(success)
x = x.reset_index()

y=pd.concat([x,success],axis=1)
y

"""
x

   index       name  score qualify  success
0      0  Anastasia   12.5     yes        1
1      1       Dima    9.0      no        0
2      2  Katherine   16.5     yes        1
3      4      Emily    9.0      no        0
4      5    Michael   20.0     yes        1
5      6    Matthew   14.5     yes        1
6      8      Kevin    8.0      no        0
7      9      Jonas   19.0     yes        1
8      0     Suresh   15.5     yes        1

In [188]:
x.to_csv("notes.csv")

success